Revit 2026 API

# Surface Properties

---

The Surface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. |

#### Reference

Surface Class

Autodesk.Revit.DB Namespace